; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v4 ?v2)
             (pred_7 ?v10 ?v13)
             (pred_9 ?v4 ?v13)
             (pred_1 ?v3 ?v4 )
	     (pred_4 ?v4)
             (pred_10 ?v9)
             (pred_11 ?v10)
             (pred_6 ?v13)
             (pred_12 ?v4)
             (pred_2 ?v10)
             (pred_5 ?v4)
             (pred_8 ))



(:action op_3
:parameters (?v1 ?v7 ?v11 ?v5)
:precondition (and (pred_10 ?v1) (pred_10 ?v7) (pred_11 ?v11) (pred_6 ?v5)
          (pred_3 ?v1 ?v7) (pred_7 ?v11 ?v5)
                   (pred_9 ?v7 ?v5) (pred_4 ?v1) 
                   (pred_12 ?v7) (pred_2 ?v11))
:effect (and  (pred_5 ?v7) (not (pred_12 ?v7))))


(:action op_1
:parameters (?v1 ?v6)
:precondition (and (pred_10 ?v1) (pred_10 ?v6)
               (pred_4 ?v1) (pred_3 ?v1 ?v6) (pred_5 ?v6))
:effect (and (pred_4 ?v6) (not (pred_4 ?v1))))

(:action op_2
:parameters (?v1 ?v11)
:precondition (and (pred_10 ?v1) (pred_11 ?v11) 
                  (pred_4 ?v1) (pred_1 ?v11 ?v1) (pred_8 ))
:effect (and (pred_2 ?v11)
   (not (pred_1 ?v11 ?v1)) (not (pred_8 ))))


(:action op_5
:parameters (?v1 ?v8 ?v12)
:precondition (and (pred_10 ?v1) (pred_11 ?v8) (pred_11 ?v12)
                  (pred_4 ?v1) (pred_2 ?v12) (pred_1 ?v8 ?v1))
:effect (and (pred_2 ?v8) (pred_1 ?v12 ?v1)
        (not (pred_2 ?v12)) (not (pred_1 ?v8 ?v1))))

(:action op_4
:parameters (?v1 ?v11)
:precondition (and (pred_10 ?v1) (pred_11 ?v11) 
                  (pred_4 ?v1) (pred_2 ?v11))
:effect (and (pred_8 ) (pred_1 ?v11 ?v1) (not (pred_2 ?v11)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_30 obj_04 obj_08 obj_27 obj_17 obj_14 obj_28 obj_15 obj_11 obj_05 obj_12 obj_29 obj_23 obj_31 obj_02 obj_20 obj_13 obj_22 obj_16 obj_21 obj_26 obj_09 obj_24 obj_18 obj_01
    obj_19 obj_07 obj_25
    obj_03 obj_10 obj_06
    )

    (:init
       (pred_8)

       (pred_10 obj_30)
       (pred_10 obj_04)
       (pred_10 obj_08)
       (pred_10 obj_27)
       (pred_10 obj_17)
       (pred_10 obj_14)
       (pred_10 obj_28)
       (pred_10 obj_15)
       (pred_10 obj_11)
       (pred_10 obj_05)
       (pred_10 obj_12)
       (pred_10 obj_29)
       (pred_10 obj_23)
       (pred_10 obj_31)
       (pred_10 obj_02)
       (pred_10 obj_20)
       (pred_10 obj_13)
       (pred_10 obj_22)
       (pred_10 obj_16)
       (pred_10 obj_21)
       (pred_10 obj_26)
       (pred_10 obj_09)
       (pred_10 obj_24)
       (pred_10 obj_18)
       (pred_10 obj_01)
       (pred_6 obj_19)
       (pred_6 obj_07)
       (pred_6 obj_25)
       (pred_11 obj_03)
       (pred_11 obj_10)
       (pred_11 obj_06)

       (pred_3 obj_30 obj_14)
       (pred_3 obj_30 obj_04)
       (pred_3 obj_04 obj_28)
       (pred_3 obj_04 obj_08)
       (pred_3 obj_04 obj_30)
       (pred_3 obj_08 obj_15)
       (pred_3 obj_08 obj_27)
       (pred_3 obj_08 obj_04)
       (pred_3 obj_27 obj_11)
       (pred_3 obj_27 obj_17)
       (pred_3 obj_27 obj_08)
       (pred_3 obj_17 obj_05)
       (pred_3 obj_17 obj_27)
       (pred_3 obj_14 obj_12)
       (pred_3 obj_14 obj_28)
       (pred_3 obj_14 obj_30)
       (pred_3 obj_28 obj_29)
       (pred_3 obj_28 obj_15)
       (pred_3 obj_28 obj_04)
       (pred_3 obj_28 obj_14)
       (pred_3 obj_15 obj_23)
       (pred_3 obj_15 obj_11)
       (pred_3 obj_15 obj_08)
       (pred_3 obj_15 obj_28)
       (pred_3 obj_11 obj_31)
       (pred_3 obj_11 obj_05)
       (pred_3 obj_11 obj_27)
       (pred_3 obj_11 obj_15)
       (pred_3 obj_05 obj_02)
       (pred_3 obj_05 obj_17)
       (pred_3 obj_05 obj_11)
       (pred_3 obj_12 obj_20)
       (pred_3 obj_12 obj_29)
       (pred_3 obj_12 obj_14)
       (pred_3 obj_29 obj_13)
       (pred_3 obj_29 obj_23)
       (pred_3 obj_29 obj_28)
       (pred_3 obj_29 obj_12)
       (pred_3 obj_23 obj_22)
       (pred_3 obj_23 obj_31)
       (pred_3 obj_23 obj_15)
       (pred_3 obj_23 obj_29)
       (pred_3 obj_31 obj_16)
       (pred_3 obj_31 obj_02)
       (pred_3 obj_31 obj_11)
       (pred_3 obj_31 obj_23)
       (pred_3 obj_02 obj_21)
       (pred_3 obj_02 obj_05)
       (pred_3 obj_02 obj_31)
       (pred_3 obj_20 obj_26)
       (pred_3 obj_20 obj_13)
       (pred_3 obj_20 obj_12)
       (pred_3 obj_13 obj_09)
       (pred_3 obj_13 obj_22)
       (pred_3 obj_13 obj_29)
       (pred_3 obj_13 obj_20)
       (pred_3 obj_22 obj_24)
       (pred_3 obj_22 obj_16)
       (pred_3 obj_22 obj_23)
       (pred_3 obj_22 obj_13)
       (pred_3 obj_16 obj_18)
       (pred_3 obj_16 obj_21)
       (pred_3 obj_16 obj_31)
       (pred_3 obj_16 obj_22)
       (pred_3 obj_21 obj_01)
       (pred_3 obj_21 obj_02)
       (pred_3 obj_21 obj_16)
       (pred_3 obj_26 obj_09)
       (pred_3 obj_26 obj_20)
       (pred_3 obj_09 obj_24)
       (pred_3 obj_09 obj_13)
       (pred_3 obj_09 obj_26)
       (pred_3 obj_24 obj_18)
       (pred_3 obj_24 obj_22)
       (pred_3 obj_24 obj_09)
       (pred_3 obj_18 obj_01)
       (pred_3 obj_18 obj_16)
       (pred_3 obj_18 obj_24)
       (pred_3 obj_01 obj_21)
       (pred_3 obj_01 obj_18)
       (pred_12 obj_23)
       (pred_12 obj_17)
       (pred_12 obj_08)
       (pred_9  obj_23 obj_19)
       (pred_9  obj_17 obj_07)
       (pred_9  obj_08 obj_25)
       (pred_5 obj_30)
       (pred_5 obj_04)
       (pred_5 obj_27)
       (pred_5 obj_14)
       (pred_5 obj_28)
       (pred_5 obj_15)
       (pred_5 obj_11)
       (pred_5 obj_05)
       (pred_5 obj_12)
       (pred_5 obj_29)
       (pred_5 obj_31)
       (pred_5 obj_02)
       (pred_5 obj_20)
       (pred_5 obj_13)
       (pred_5 obj_22)
       (pred_5 obj_16)
       (pred_5 obj_21)
       (pred_5 obj_26)
       (pred_5 obj_09)
       (pred_5 obj_24)
       (pred_5 obj_18)
       (pred_5 obj_01)

       (pred_7  obj_03 obj_19)
       (pred_7  obj_10 obj_07)
       (pred_7  obj_06 obj_25)
       (pred_1 obj_03 obj_22)
       (pred_1 obj_10 obj_18)
       (pred_1 obj_06 obj_11)
       (pred_4 obj_30)
    )

    (:goal (and
       (pred_1 obj_03 obj_01)
       (pred_1 obj_10 obj_04)
    ))
(:constraints
  (always (not (pred_4 obj_16)))
)
)

; plan
1. (op_1 obj_30 obj_04)
   deleted: (pred_4 obj_30)
   added: (pred_4 obj_04)
   goals met: 0 of 2
2. (op_1 obj_04 obj_28)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_28)
   goals met: 0 of 2
3. (op_1 obj_28 obj_29)
   deleted: (pred_4 obj_28)
   added: (pred_4 obj_29)
   goals met: 0 of 2
4. (op_1 obj_29 obj_13)
   deleted: (pred_4 obj_29)
   added: (pred_4 obj_13)
   goals met: 0 of 2
5. (op_1 obj_13 obj_22)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_22)
   goals met: 0 of 2
6. (op_2 obj_22 obj_03)
   deleted: (pred_1 obj_03 obj_22) (pred_8)
   added: (pred_2 obj_03)
   goals met: 0 of 2
7. (op_1 obj_22 obj_24)
   deleted: (pred_4 obj_22)
   added: (pred_4 obj_24)
   goals met: 0 of 2
8. (op_1 obj_24 obj_18)
   deleted: (pred_4 obj_24)
   added: (pred_4 obj_18)
   goals met: 0 of 2
9. (op_1 obj_18 obj_01)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_01)
   goals met: 0 of 2
10. (op_4 obj_01 obj_03)
   deleted: (pred_2 obj_03)
   added: (pred_8) (pred_1 obj_03 obj_01)
   goals met: 1 of 2
11. (op_1 obj_01 obj_18)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_18)
   goals met: 1 of 2
12. (op_2 obj_18 obj_10)
   deleted: (pred_1 obj_10 obj_18) (pred_8)
   added: (pred_2 obj_10)
   goals met: 1 of 2
13. (op_1 obj_18 obj_24)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_24)
   goals met: 1 of 2
14. (op_1 obj_24 obj_22)
   deleted: (pred_4 obj_24)
   added: (pred_4 obj_22)
   goals met: 1 of 2
15. (op_1 obj_22 obj_13)
   deleted: (pred_4 obj_22)
   added: (pred_4 obj_13)
   goals met: 1 of 2
16. (op_1 obj_13 obj_29)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_29)
   goals met: 1 of 2
17. (op_1 obj_29 obj_28)
   deleted: (pred_4 obj_29)
   added: (pred_4 obj_28)
   goals met: 1 of 2
18. (op_1 obj_28 obj_04)
   deleted: (pred_4 obj_28)
   added: (pred_4 obj_04)
   goals met: 1 of 2
19. (op_4 obj_04 obj_10)
   deleted: (pred_2 obj_10)
   added: (pred_8) (pred_1 obj_10 obj_04)
   goals met: 2 of 2
